import pymongo as pm
import pandas as pd
import certifi

#클라이언트 연결
client = pm.MongoClient('mongodb+srv://OSSPCOCONUT:coconut123@ossp-cluster.3vu4p.mongodb.net/test?retryWrites=true&w=majority', tlsCAFile=certifi.where())

#stopword data
stopword=['것','사람','가시','강릉','마지막','조금','참고','당일','브레이크','화요일','엄마','것','주소','영업','근교','가지',
         '주문','연중','횟집','타임','얼마','영어','내','지역','전화번호','경기','저희','고기','출발','자주','가성','아파트','성인',
         '나','테마','입구','계획','점심','대표','사업','번지','리뷰','베트남','매장','수','게','코스','느낌','로번','모두','진짜',
         '번길','조성','할인','사용','관리','말','이야기','이번','하루','네이버','검색','갈비','기억','입실','마치','랜선','등','거리',
         '호텔','중앙','시설','준비','먼저','대한민국','퇴실','경주','사장','제','매일','장소','지난','대한','저녁','아주','인근','진행',
         '국밥','이웃','륙','시작','문의','오후','학교','가득','아래','시민','관련','지원','지번','끼','기분','숙소','처음','이후','영상',
         '사실','예전','모임','인테리어','숙박','인천','통영','입장료','공간','가야','발견','다른','그냥','통해','사회','서비스','강원',
         '메뉴','무료','모습','호선','리스트','오픈','라면','밀리','택시','오션','충북','한번','세종','출처','사이','기행','이상','출구',
         '여러분','방역','하우스','충청','지금','우리','홈페이지','식당','거의','가면','지정','잠시','일본','올해','전북','한국','예약',
         '자리','원래','기록','생활','직접','화장실','프로그램','돼지','전남','요즘','휴무','입장','마무리','식사','선정','현재',
         '정상','단지','본점','전라','월요일','가능','중구','레이스','최대','공사','방법','현대','전주','기자','경북','운영','마음',
         '어디','탐방','시대','보기','동안','하늘','짬뽕','만원','경남','바로','전화','버스','설치','최근','연락처','국가','밥집',
         '업체','월월','경상','때문','이용','오전','판매','오시','구이','체크','피자','미리','두기','도','주변','위해','포스팅','규모',
         '해외','이름','역시','중심','정리','지인','대전','보고','날씨','아침','주민','정자','일정','갈이','주택','전문점','오토','대구',
         '평일','매매','블로그','대해','항상','남해','확인','일상','천리','간다','광주','차로','완전','건물','이유','서이추','포장','요금',
         '마루','스타','가든','부산','전문','남편','다시','기간','추가','마감','서포터즈','테이블','울산','보시','뉴스','세계','모든',
         '마스크','이동','휴가','김밥','여행','경우','생생','가격','음식점','홍보','번호','종합','만들기','추천','선택','맞이','세상',
         '선생','상호','방향','일차','진자','상품','매력','현장','방송','중국','전국','센터','상황','스카이','월일','객실','그대로','근처',
         '정식','인스타','생방송','서로','박일','배달','기념','투어','온라인','소개','기준','여러','찍기','목적','시간','시기','롯데',
         '회관','하니','오늘','작년','바퀴','최초','일찍','후기','포함','소식','공항','곳곳','정보','신상','예정','시국','소재','인생',
         '계속','환영','아빠','일대','타고','빌라','터미널','그램','절기','별로','베스트','단계','머리','기사','태국','비대','안심','선물',
         '공유','부터','택트','반찬','출장','최고','시시','세트','위치','밥상','자락','방문','더욱','지구','주차','일단','솔직','가기',
         '외관','관광객','서울','또한','구매','생각','현지','랜드','다음','작성','타운','여기','곡리','명소','자단','가장','동반','문화',
         '태국']


db = client["stopword"]
collec = db["main"]

for word in stopword:
    insert_data = {"word_name":str(word)}
    collec.insert_one(insert_data)

client.close()
